In [ ]:
## Importing necessary packages

import pandas as pd

In [ ]:
## Loading of the Dataset

df = pd.read_csv("/content/drive/MyDrive/Datasets/titanic.csv")
df.head()

   PassengerId  ... Survived
0            1  ...        0
1            2  ...        1
2            3  ...        1
3            4  ...        1
4            5  ...        0

[5 rows x 12 columns]

In [ ]:
## Dropping unnecessary columns from the Dataset

df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [ ]:
## Separating out the input and output variables

inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [ ]:
## Applying one-hot encoding on Gender attribute

dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [ ]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [ ]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [ ]:
## Checking for Null values

inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [ ]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [ ]:
## Treating Null values

inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [ ]:
## Train_test_split of the original dataset

from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [ ]:
## Model Building

from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [ ]:
## Fitting the model to training data

model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [ ]:
model.score(X_test,y_test)

0.746268656716418

In [ ]:
X_test[0:10]

     Pclass        Age     Fare  female
181       2  29.699118  15.0500       0
875       3  15.000000   7.2250       1
197       3  42.000000   8.4042       0
455       3  29.000000   7.8958       0
531       3  29.699118   7.2292       0
658       2  23.000000  13.0000       0
750       2   4.000000  23.0000       1
791       2  16.000000  26.0000       0
283       3  19.000000   8.0500       0
82        3  29.699118   7.7875       1

In [ ]:
model.predict(X_test[0:10])

array([0, 1, 0, 0, 0, 0, 1, 0, 0, 1])

In [ ]:
model.predict_proba(X_test[:10])

array([[0.94267118, 0.05732882],
       [0.36389428, 0.63610572],
       [0.97452254, 0.02547746],
       [0.9733553 , 0.0266447 ],
       [0.97345385, 0.02654615],
       [0.93728611, 0.06271389],
       [0.14484725, 0.85515275],
       [0.92293124, 0.07706876],
       [0.96856324, 0.03143676],
       [0.4317308 , 0.5682692 ]])

In [ ]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.824     , 0.768     , 0.792     , 0.77419355, 0.79032258])